import getpass
import os
import hashlib
import json
from app.ensure_unlocked import ensure_unlocked
from cryptography.fernet import Fernet
from app.validate_pw import validate_pw
from app.session_valid import session_valid
from app.pw_generate import random_pw_generator





def init():
    if os.path.exists("vault.json"):
        print("you already have a vault pls use unlock")
        exit(1)

    print(r"""
    ██╗  ██╗███████╗██╗   ██╗██╗   ██╗ █████╗ ██╗   ██╗██╗  ████████╗
    ██║ ██╔╝██╔════╝╚██╗ ██╔╝██║   ██║██╔══██╗██║   ██║██║  ╚══██╔══╝
    █████╔╝ █████╗   ╚████╔╝ ██║   ██║███████║██║   ██║██║     ██║   
    ██╔═██╗ ██╔══╝    ╚██╔╝  ╚██╗ ██╔╝██╔══██║██║   ██║██║     ██║   
    ██║  ██╗███████╗   ██║    ╚████╔╝ ██║  ██║╚██████╔╝███████╗██║   
    ╚═╝  ╚═╝╚══════╝   ╚═╝     ╚═══╝  ╚═╝  ╚═╝ ╚═════╝ ╚══════╝╚═╝   
                                                                    

                    🔐 Lets create your KeyVault 🔐
                    Your digital secrets. Fortified. 🔒✨
    """)

    pw_1 = getpass.getpass("Create your password: ")
    pw_confirm = getpass.getpass("Confirm your password: ")
    hint = input("Enter a hint for your password (optional): ").strip()

    if pw_1 != pw_confirm:
        print("\n❌ Oops! Passwords don't match. Try again.\n")
        pw_1 = ""
        pw_confirm = ""
        init()

    salt = os.urandom(16)
    combined = str(salt) + pw_1

    hashed = hashlib.sha256(combined.encode())

    vault_data = {
        "user": {
            "salt": str(salt),
            "user_pw": hashed.hexdigest(),
            "hint": hint if hint else "No hint provided"
        },
        "vault": {}  
    }
    
    with open("vault.json", "w") as file:
        json.dump(vault_data, file, indent=4)
        print(r"""
██╗   ██╗ █████╗ ██╗   ██╗██╗  ████████╗     ██████╗██████╗ ███████╗ █████╗ ████████╗███████╗██████╗ 
██║   ██║██╔══██╗██║   ██║██║  ╚══██╔══╝    ██╔════╝██╔══██╗██╔════╝██╔══██╗╚══██╔══╝██╔════╝██╔══██╗
██║   ██║███████║██║   ██║██║     ██║       ██║     ██████╔╝█████╗  ███████║   ██║   █████╗  ██║  ██║
╚██╗ ██╔╝██╔══██║██║   ██║██║     ██║       ██║     ██╔══██╗██╔══╝  ██╔══██║   ██║   ██╔══╝  ██║  ██║
 ╚████╔╝ ██║  ██║╚██████╔╝███████╗██║       ╚██████╗██║  ██║███████╗██║  ██║   ██║   ███████╗██████╔╝
  ╚═══╝  ╚═╝  ╚═╝ ╚═════╝ ╚══════╝╚═╝        ╚═════╝╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝   ╚═╝   ╚══════╝╚═════╝ 
                                                                                                     
            """)
    
    print("\n use 'unlock' to get started \n")
    with open(".lock", "w") as f:
        f.write("locked")